src/Catalogs/ИнтеграцияBankFeeds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИнтеграцияBankFeeds</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AppID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисыBankFeeds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКСертификату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогХраненияКлючей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СтатусыТранзакцийBankFeeds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыТранзакцийBankFeeds</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторТранзакции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежныхДокументовBankFeeds</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВСервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПлатежныеДокументыBankFeeds</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИдентификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИдентификаторовBankFeeds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПлатежныхДокументовBankFeeds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПлатежныхДокументовBankFeeds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>pending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>posted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>processing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>accepted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>rejected</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>failed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>deleted</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИнтеграцияBankFeeds/Forms/ФормаПодтверждениеПлатежаВСервисе/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МассивСсылокНаПодтверждениеПлатежей	= Параметры.МассивСсылкокНаПодтверждениеПлатежей;  
	СсылкаНаПодтверждениеПлатежа = МассивСсылокНаПодтверждениеПлатежей[0].СсылкаНаПодтверждениеПлатежа; 
	АдресБанковскиеСчета = Параметры.АдресБанковскиеСчета;
	АдресДокументыКВыгрузке = Параметры.АдресДокументыКВыгрузке;
	ВыгрузкаВыполняетсяПриСинхронизации = Параметры.ВыгрузкаВыполняетсяПриСинхронизации;  
	БанковскийСчет = Параметры.БанковскийСчет;
	
	Для Каждого ТекущаяСтрокаМассивСсылкокНаПодтверждениеПлатежей Из МассивСсылокНаПодтверждениеПлатежей Цикл
		
		ДанныеПлатежногоДокумента = ТекущаяСтрокаМассивСсылкокНаПодтверждениеПлатежей.ДанныеПлатежногоДокумента;
		
		ТекстПредставления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1, на сумму %2 (%3)'"),
				ДанныеПлатежногоДокумента.ВидДокумента,
				ДанныеПлатежногоДокумента.Сумма,
				ДанныеПлатежногоДокумента.Валюта);
					
		НоваяСтрока = ТаблицаПлатежейДляПодтвержденияПлатежа.Добавить();			
		НоваяСтрока.ТекстПодтвердить = ТекстПредставления;
		НоваяСтрока.ПлатежныйДокумент = ДанныеПлатежногоДокумента.Ссылка;
		НоваяСтрока.ВидДокумента = ДанныеПлатежногоДокумента.ВидДокумента;
		НоваяСтрока.Сумма = ДанныеПлатежногоДокумента.Сумма;
		НоваяСтрока.Валюта = ДанныеПлатежногоДокумента.Валюта;
		НоваяСтрока.Номер = ДанныеПлатежногоДокумента.Номер;
		НоваяСтрока.Дата = ДанныеПлатежногоДокумента.Дата;
		НоваяСтрока.СсылкаНаПодтверждениеПлатежа = 
			ТекущаяСтрокаМассивСсылкокНаПодтверждениеПлатежей.СсылкаНаПодтверждениеПлатежа; 
		НоваяСтрока.Сервис = ТекущаяСтрокаМассивСсылкокНаПодтверждениеПлатежей.ПараметрыЗаполнения.Сервис;
		
	КонецЦикла;	

	Если ТаблицаПлатежейДляПодтвержденияПлатежа.Количество() > 0 Тогда
		ТекущиеДанные = ТаблицаПлатежейДляПодтвержденияПлатежа[0];
		
		СформироватьОтображениеТекстаПодтвержденияПлатежаНаСервер(
						ТекущиеДанные.ПлатежныйДокумент,
						ТекущиеДанные.ВидДокумента, 
						ТекущиеДанные.Номер,
						ТекущиеДанные.Дата,
						ТекущиеДанные.Сумма,
						ТекущиеДанные.Валюта,
						ТекущиеДанные.Сервис,
						ТекущиеДанные.СсылкаНаПодтверждениеПлатежа);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатусыПлатежей(Команда)

	ОбменССервисомBankFeedsКлиент.ПроверитьСтатусПлатежейПослеОтправки(ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПлатежейДляПодтвержденияПлатежа

&НаКлиенте
Процедура ТаблицаПлатежейДляПодтвержденияПлатежаПриАктивизацииПоля(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПлатежейДляПодтвержденияПлатежа.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СформироватьОтображениеТекстаПодтвержденияПлатежаНаСервер(
						ТекущиеДанные.ПлатежныйДокумент,
						ТекущиеДанные.ВидДокумента, 
						ТекущиеДанные.Номер,
						ТекущиеДанные.Дата,
						ТекущиеДанные.Сумма,
						ТекущиеДанные.Валюта,
						ТекущиеДанные.Сервис,
						ТекущиеДанные.СсылкаНаПодтверждениеПлатежа);
						
	Иначе
		
		Элементы.ДекорацияПодтвержденияПлатежа.Заголовок = Новый ФорматированнаяСтрока(
		    					НСтр("ru = 'Все платежные документы отправлены'"));
			
	КонецЕсли;					
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Если ТаблицаПлатежейДляПодтвержденияПлатежа.Количество() = 1 Тогда
		Заголовок = НСтр("ru = 'Подтверждение платежа в сервисе'");
		
		Элементы.ТаблицаПлатежейДляПодтвержденияПлатежа.Видимость = False;
		
		Элементы.ФормаПодтверждения.Подсказка = НСтр("ru = 'После подтверждения платежей, закройте это окно'");
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСписокПлатежей() Экспорт
	
	ОбновитьСписокПлатежейНаСервере();
	
	Если ТаблицаПлатежейДляПодтвержденияПлатежа.Количество() > 0 Тогда
		ТекущиеДанные = ТаблицаПлатежейДляПодтвержденияПлатежа[0];
		
		СформироватьОтображениеТекстаПодтвержденияПлатежаНаСервер(
						ТекущиеДанные.ПлатежныйДокумент,
						ТекущиеДанные.ВидДокумента, 
						ТекущиеДанные.Номер,
						ТекущиеДанные.Дата,
						ТекущиеДанные.Сумма,
						ТекущиеДанные.Валюта,
						ТекущиеДанные.Сервис,
						ТекущиеДанные.СсылкаНаПодтверждениеПлатежа);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСписокПлатежейНаСервере()
	
	МассивПлатежей = Новый Массив();
	Для Каждого ТекущаяСтрокаТаблицаПлатежейДляПодтвержденияПлатежа Из ТаблицаПлатежейДляПодтвержденияПлатежа Цикл
		
		МассивПлатежей.Добавить(ТекущаяСтрокаТаблицаПлатежейДляПодтвержденияПлатежа.ПлатежныйДокумент);
		
	КонецЦикла;	
	
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("МассивПлатежей", МассивПлатежей);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыТранзакцийBankFeeds.Объект КАК ПлатежныйДокумент,
	|	СтатусыТранзакцийBankFeeds.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыТранзакцийBankFeeds КАК СтатусыТранзакцийBankFeeds
	|ГДЕ
	|	СтатусыТранзакцийBankFeeds.Объект В(&МассивПлатежей)";
	
	Результат = Запрос.Выполнить().Выбрать();
	ФильтрПоПлатежам = Новый Структура("ПлатежныйДокумент");
	
	Пока Результат.Следующий() Цикл
		
		Если Результат.Статус = Перечисления.СтатусыПлатежныхДокументовBankFeeds.НеОтправлен Тогда
			Продолжить;
		КонецЕсли;	
		
	    ФильтрПоПлатежам.ПлатежныйДокумент = Результат.ПлатежныйДокумент;
		
		НайденныеСтроки = ТаблицаПлатежейДляПодтвержденияПлатежа.НайтиСтроки(ФильтрПоПлатежам);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			ТаблицаПлатежейДляПодтвержденияПлатежа.Удалить(НайденныеСтроки[0]);				
	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Процедура СформироватьОтображениеТекстаПодтвержденияПлатежаНаСервер(ПлатежныйДокумент,ВидДокумента,Номер,Дата,Сумма,Валюта,Сервис,СсылкаНаПодтверждениеПлатежа)
	
	Элементы.ДекорацияПодтвержденияПлатежа.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Согласно требованиям провайдера, <a href = ""%1"">%2 </a> %3 необходимо подтвердить на сайте сервиса %4
				|Перейдите по <a href = ""%5"">Ссылке</a> и подтвердите платеж'"),
		ПолучитьНавигационнуюСсылку(ПлатежныйДокумент), ВидДокумента + НСтр("ru = ' №'") + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер) 
			+" от: "+ Формат(Дата, "ДФ=dd.MM.yyyy; ДЛФ=D"), 
			НСтр("ru = 'на сумму'") + " " + Сумма + " "+ Валюта, 
		Сервис,	СсылкаНаПодтверждениеПлатежа);
	
КонецПроцедуры

#КонецОбласти
